Repository: Ravingrabb/spotiboi
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Recently played tracks
ru: История

source: Success!
ru: Успешно!

source: Error! Can't find that last.fm user
ru: Ошибка! Не могу найти такого юзера в last.fm

source: bruh
ru: Произошла какая-то ошибка... 🤔

source: Can't connect to Spotify server
ru: Не могу подключиться к Spotify

source: History updated
ru: История обновлена

source: Nothing to update
ru: Нечего добавлять

source: - Create a playlist
ru: - Создание плейлиста

source: Create a new smart playlist
ru: Создать новый умный плейлист

source: Create playlist
ru: Создать плейлист

source: Support project
ru: Поддержать проект

source: I have always dreamed of making money on what I create. At the same time, I respect free software, so your best option in this case would be your voluntary support.
ru: Я всегда мечтал зарабатывать на том, что создаю с душой. В то же время я безумно уважаю труд людей, которые разрабатывают бесплатное ПО, поэтому сам не стану продавать свой продукт. Лучшим решением в этом случае является добровольная поддержка проекта.

source: The main funds will go to pay for the server and the annual payment for domains. The rest will keep me motivated to continue working on the project :) The development of the project directly depends on this.
ru: Основная статья расходов - поддержание сервера и ежегодная оплата доменов. Все остальные средства будут мотивировать меня к дальнейшему развитию проекта.

source: You can become a subscriber and support me every month, or make a one-time donation by clicking on the button below
ru: Вы можете поддержать проект двумя путями: стать подписчиком и поддерживать каждый месяц в автоматическом режиме, либо поддержать единожды, нажав по кнопке ниже и перейдя на страницу доната.

source: Or make a donation here :)
ru: Либо, вы можете сделать пожертвование здесь :)

source: Thanks a lot in advance!
ru: Заранее больше спасибо!

source: What is Spotiboi for?
ru: Для чего нужен Spotiboi?

source: First of all, Spotiboi was created to work with a <a href="http://smarterplaylists.playlistmachinery.com">Smarter playlists</a> service. Spotiboi collects information about the songs you listened to and moves these songs into a separate playlist called "History". In the future, you can use the "History" playlist to create smart playlists and exclude songs you've already listened to.
ru: Прежде всего Spotiboi создан для работы с сервисом Smarter playlists. Spotiboi собирает информацию о тех песнях, которые ты уже прослушал и добавляет их в отдельный плейлист, который называется 'History'. После этого вы сможете использовать этот плейлист для создания умных плейлистов, в которых прослушанные песни будут исключаться из треклиста.

source: Spotiboi adds only 50 songs at a time. Why?
ru: Spotiboi добавляет только 50 последних прослушанных треков. Почему?

source: This is an API limitation of Spotify :(
ru: Это уже ограничения API, сорри :(

source: What is Spotify API?
ru: Что такое Spotify API?

source: This is the link between our service and Spotify. Spotiboy "knocks" on the Spotify service and prompts certain data, such as your listening history or your playlists.
ru: Это связующее звено между нашим сервисом и Spotify. Spotiboi 'стучит' в сервис Spotify и получает определённые данные, например вашу историю прослушиваний или ваши плейлисты.

source: Songs are not added to my playlist!
ru: Песни не добавляются в мой плейлист!

source: You should make you History playlist public. Any tracks listened to while the user had “Private Session” enabled in their client will not be added.
ru: Прежде всего проверьте, чтобы ваш плейлист был общедоступным (не закрытым). Обычно проблема именно в этом.

source: Are skipped songs will be added to the playlist?
ru: Пропущенные (скипнутые) треки будут добавлены в плейлист?

source: No. You must listen to the song to the end, or you can rewind the song to the very end and then it will be counted (rewinding is not recommended).
ru: Нет. Вам нужно будет прослушать трек до конца или перемотать его в самый конец, но так делать не рекомендуется, чтобы не сбить рекомендации спотифай. Как альтернативный вариант можно использовать интеграцию с Last.fm в настройках плейлиста spotiboi. Треки в last.fm попадают уже в том случае, если хотя бы дослушаны до половины.

source: On the History page, group names in Cyrillic are displayed in Latin
ru: На странице 'История' названия русских треков отображается на латинице

source: Unfortunately, this is a Spotify API 'feature'. Adding tracks to the playlist will not be affected by this
ru: К сожалению, это 'фишка' работы Spotify API. В их базе многие русские исполнители и названия треков хранятся на латинице, но это никак не повлияет на работу и в вашем плейлисте треки будут добавляться и отображаться правильно, то есть на русском :)

source: I can't attach a playlist
ru: Я не могу прикрепить плейлист

source: Check your playlist privacy. You should make your History playlist public. Any tracks listened to while the user had “Private Session” enabled in their client will not be added. Also check that your URI is correct and it's not URL.
ru: Проверьте настройки приватности вашего плейлиста. Вам нужно сделать плейлист общедоступным. В приватный плейлист не может достучаться Spotify API и получить хоть какие-нибудь данные. Также обязательно проверьте, что указываете именно URI, а не URL - это два разных ввида ссылок.

source: Hi
ru: Привет

source: sign out
ru: выйти

source: Detach playlist
ru: Открепить плейлист

source: No artwork
ru: Нет обложки

source: This is your History playlist
ru: Это твой плейлист

source: Auto-update History
ru: Автообновление плейлиста

source: Update
ru: Обновить

source: Updated
ru: Обновлено

source: min ago
ru: мин. назад

source: You don't have attached history playlist
ru: У вас нет прикреплённого плейлиста истории

source: Create now
ru: Создать

source: Attach your own playlist
ru: Прикрепить свой собственный плейлист

source: This is your smart playlist
ru: Это твой умный плейлист

source: Auto-update
ru: Автообновление

source: You don't have created smart playlist
ru: Ты ещё не создал свой Smart Playlist

source: Liked songs
ru: Любимые треки

source: Create playlist with your favorite songs
ru: Создай отдельный плейлист с твоими любимыми песнями

source: Create new
ru: Создать

source: Warning!
ru: Внимание!

source: Are you sure you want to detach the playlist?
ru: Вы уверены, что хотите открепить плейлист?

source: Yes
ru: Да

source: No
ru: Нет

source: Playlist URI
ru: URI плейлиста

source: If you can't find URI, right-click on your playlist -> Share -> Copy Spotify URI. Do not confuse with URL!
ru: Если вы не можете найти URI, с ПК версии нажмите правой кнопкой мыши по плейлисту -> Поделиться -> Копировать Spotify URI.. Не перепутайте с URL!

source: Attach
ru: Прикрепить

source: Settings
ru: Настройки

source: Fixed de-duplicate
ru: Проверять на дубли последние N треков

source: Value must be 200 or more tracks
ru: Значение должно быть 200 или более треков

source: Fixed playlist
ru: Фиксированный плейлист

source: Must be 100 or more tracks
ru: Укажите 100 или более треков

source: Auto-update time
ru: Время автоматического обновления

source: In minutes (10 or more)
ru: В минутах (10 или более)

source: Integration with Last.fm
ru: Интеграция с last.fm

source: Attention! When integration is enabled, the update will take much longer.
ru: Внимание! Когда интеграция включена, обновление будет занимать намного больше времени.

source: Save
ru: Сохранить

source: When enabled, Spotiboi will check duplicates of the last N tracks of your History Playlist. This is necessary to speed up the update function
ru: Ваш плейлист с историей будет проверяться на дубликаты. В поле ниже укажите кол-во треков, которые будут проверяться. В первую очередь это нужно для того, чтобы при авто-обновлении в ваш плейлист не добавлялись одни и те же треки раз за разом. Рекомендуется использовать значение между 200 и 300 треками. Выключение функции может нагружать сервер и запросы будут обрабатываться дольше, так что отключать не рекомендуется :)

source: When enabled, limits the size of your playlist to the number of tracks specified in the setting. New tracks will be added, old ones removed.
ru: Когда функция включена, ограничивает размер вашего плейлиста числом треков, указанным в настройках. Новые треки будут добавляться, старые - удаляться. Если функция выключена - плейлист не будет ограничен.

source: Select your playlist:
ru: Выберите свой плейлист:

source: Show more...
ru: Показать больше...

source: Provide links to playlists to be merged into your smart playlist
ru: Укажите ссылки на плейлисты, которые будут прикреплены к smart плейлисту

source: Will be added
ru: Будут добавлены:

source: Attached playlists
ru: Прикреплённые плейлисты

source: You don't have attached playlists
ru: У вас нет прикреплённых плейлистов

source: Add playlists
ru: Добавить плейлисты

source: Add
ru: Добавить

source: Playlist settings
ru: Настройки плейлиста

source: Maximum tracks in playlist
ru: Максимальное количество треков в плейлисте

source: Update time
ru: Время обновления

source: In days
ru: В днях

source: Exclude History
ru: Исключать историю прослушивания

source: This setting slows down the update of the playlist
ru: Эта настройка замедляет обновление плейлиста

source: Exclude Favorite Tracks
ru: Исключать любимые треки

source: Save settings
ru: Сохранить настройки

source: Are you sure you want to unpin the playlist from your smart playlist?
ru: Вы уверены, что хотите открепить плейлист?

source: Create playlist with your recently playing tracks
ru: Создай свой плейлист с историей прослушиваний

source: And automatically update it with one button
ru: И обновляй его автоматически всего одной кнопкой

source: Log in with Spotify
ru: Войти с помощью Spotify
